{
    "grantha":"तोटकाष्टकम्",
    "grantha_kartha": "तोटकाचार्यः",
    "grantha_type": "stotra",
    "error": "Meaning unavailable.",
    "slokas": [
        {
            "sloka_number": 1,
            "sloka": [
                "I meditate upon the feet of my guru (śaṅkara).  Oh śaṅkara! enlightened in the śāstras and a reservoir of knowledge contained in the upaniṣads, be my refuge."
            ]
        },
        {
            "sloka_number": 2,
            "sloka": ["Oh Compassionate guru! protect me who is inundated with suffering in this world. Oh śaṅkara! Make me a knower of the purport of the śāstras and be my refuge."]
        },
        {
            "sloka_number": 3,
            "sloka": ["Oh Contemplator of ātma, men become content by you (your teachings). Oh śaṅkara! Make me a discerner of īśvara​: and jīva​: and be my refuge."]
        },
        {
            "sloka_number": 4,
            "sloka": ["I've realized that you are īśvara​: verily. Oh śaṅkara! Dissuade me from moha (delusion/infatuation with saṃsāra) and be my refuge."]
        },       
        {
            "sloka_number": 5,
            "sloka": ["Owing to virtuous deeds performed over several lives, the desire to consider everything equally arises. Oh śaṅkara! Protect me, the helpless, and be my refuge."]
        },       
        {
            "sloka_number": 6,
            "sloka": ["mahātmās, incognito, wander around to protect the world. Amongst them, you shine like the sun. Oh śaṅkara! be my refuge."]
        },
        {
            "sloka_number": 7,
            "sloka": ["Best amongst the gurus! īśvara​! Compassionate towards those who have taken refuge! Treasure-trove of tattva! You are peerless in intellect. Oh śaṅkara! Be my refuge."]
        },        
        {
            "sloka_number": 8,
            "sloka": ["I'm not adept at any thing nor do I possess any wealth. Oh śaṅkara! Protect me with your innate grace and be my refuge."]
        }                                         
    ]
}
