{
    "grantha":"प्रश्नोत्तररत्नमालिका",
    "grantha_kartha": "श्री शङ्कराचार्यः",
    "grantha_type": "prasnottara",
    "error": "Meaning unavailable.",
    "slokas": [
        {
            "sloka_number": 1,
            "sloka": [
                "Who, determined for success in visible and invisible endeavors, is not adorned by memorizing praśnottararatnamālikā?"
            ]
        },
        {
            "sloka_number": 2,
            "sloka": [
                "1. What must be obtained (accepted)? guru's instructions.",
                "2. What must be given up? Forbidden action; Action that should not be done",
                "3. Who is guru? One who has realized the tattva (everlasting and unchanging truth),  Who is ever acting in śiṣya's interests."
            ]
        },
        {
            "sloka_number": 3,
            "sloka": [
                "4. What must be expedited by the wise? End the cycle of saṃsāra (birth and death)",
                "5. What is the seed for the tree called mokṣa (release from saṃsāra)? Knowledge obtained by performing prescribed actions and duties."
            ]
        },
        {
            "sloka_number": 4,
            "sloka": [
                "6. What is most beneficial?  dharmaḥ.",
                "7. Who is pure? One whose mind is clean.",
                "8. Who is a pandita?, One who is wise.",
                "9. What is harmful like poison? Not abiding in guru's instructions."
            ]
        },
        {
            "sloka_number": 5,
            "sloka": [
                "10. What is essence of samsara?  Thinking about this and understanding that it has no essence",
                "11. What is the most desirable amongst desires in men? A life which is beneficial to self and others."
            ]
        },
        {
            "sloka_number": 6,
            "sloka": [
                "12. What is obsessive like alcohol? Attachment to children, etc.",
                "13. Who are the real thieves? Objects of the senses.",
                "14. What grows like a creeper? Extreme desire.",
                "15. Who is the real enemy? Not making an effort, laziness."
            ]
        }                      
    ]
}